Revit 2020 API
FieldBuilder Members
The FieldBuilder type exposes the following members.
Constructors
Name | Description
FieldBuilder(FieldBuilder)
 Constructs a new copy of the input ESFieldBuilder object.
FieldBuilder(Field, SchemaBuilder)
 Constructs a new FieldBuilder using the field and associated SchemaBuilder object.
Methods
Name | Description
Dispose
Releases all resources used by the FieldBuilder
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
NeedsSubSchemaGUID
 Checks whether the SubSchema GUID needs to be explicitly specified for this field type.
NeedsUnits
 Checks whether the field type requires explicit unit conversions.
Ready
 Checks whether the builder may be used.
SetDocumentation
 Sets the documentation string for the Field.
SetSubSchemaGUID
 Sets the GUID of the Schema of the Entities that are intended to be stored in this field.
SetUnitType
 Sets the type of units for the field.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
FieldBuilder Class
Autodesk.Revit.DB.ExtensibleStorage Namespace